import { TOOLTIP_ATTRIBUTE } from '../../../constants';
import { numberWithCommas } from '../../../helpers/helpers_s3d2';
import { openPopup } from './popUpManager';
import { estimatePopup } from './popups/estimatePopup';
import { helpPopup } from './popups/helpPopup';
import { priceDynamicsPopup } from './popups/priceDynamicsPopup';
import { reservationPopup } from './popups/reservationPopup';
import { initReservationPopup } from './popups/reservationPopupLogic';

export function s3d2ReservationBlock(i18n, flat) {
  const t = key => i18n?.t?.(key) || key;

  const formatPrice = v =>
    new Intl.NumberFormat('en-US', {
      style: 'currency',
      currency: 'USD',
      maximumFractionDigits: 0,
    }).format(v);

  const estimatedIncome = formatPrice(Math.round(flat.price * 0.08));
const reservationAmount = flat.price ? `${t("currency_label")} ${numberWithCommas(Math.round(flat.price * 0.01))}` : "$10,000";
  // 🔥 delegation один раз на document
  if (!document.__reservationDelegation) {
    document.addEventListener('click', e => {
      const priceBtn = e.target.closest('[data-action="price-dynamics"]');
      if (priceBtn) {
        openPopup(priceDynamicsPopup(i18n, flat));
      }

      const reserveBtn = e.target.closest('[data-action="reserve-unit"]');
      if (reserveBtn) {
        openPopup(reservationPopup(i18n, flat, estimatedIncome,reservationAmount));
        initReservationPopup(i18n,flat)
      }
      const helpBtn = e.target.closest('[data-action="help-popup"]');
      if (helpBtn) {
        openPopup(helpPopup(i18n, flat));
      }
      const estimateBtn = e.target.closest('[data-action="estimated-income"]');
      if (estimateBtn) {
        openPopup(estimatePopup(i18n, flat));
      }
    });

    document.__reservationDelegation = true;
  }

  // зберігаємо щоб popup мав доступ
  window.i18n = i18n;
  window.currentFlat = flat;

  return `
  <section class="s3d2-reservation-section">
    <div class="s3d2-reservation-block">
      <div class="reservation-left">
        <div class="reservation-left__status">
          <div class="s3d-flat-dashboard__status-label" ${
            flat.sale == 1 ? `${TOOLTIP_ATTRIBUTE}="${i18n.t('unit_statuses.1_tooltip')}"` : ''
          }  data-sale='${flat.sale}'>
          
          <span>${i18n.t(`sales.${flat.sale}`)}</span>
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
              <path d="M8 1C4.13404 1 1 4.13404 1 8C1 11.866 4.13404 15 8 15C11.866 15 15 11.866 15 8C15 4.13404 11.866 1 8 1ZM7.49414 6.64258C7.89296 6.64263 8.20081 6.74476 8.41699 6.94922C8.63313 7.15359 8.74121 7.41997 8.74121 7.74707C8.74118 7.81456 8.73381 7.93343 8.71875 8.10352C8.70374 8.27424 8.67603 8.4311 8.63574 8.57324L8.22266 10.125C8.18919 10.2494 8.15957 10.3918 8.13281 10.5518C8.10595 10.7117 8.0918 10.8332 8.0918 10.915C8.09185 11.1208 8.13562 11.2614 8.22266 11.3359C8.30978 11.4106 8.46125 11.4482 8.67578 11.4482C8.7763 11.4482 8.89024 11.4289 9.01758 11.3916C9.14481 11.3543 9.23695 11.3214 9.29395 11.293L9.18359 11.7734C8.85171 11.9121 8.58641 12.0179 8.38867 12.0908C8.19094 12.1636 7.96154 12.2002 7.7002 12.2002C7.29807 12.2002 6.98562 12.0957 6.7627 11.8877C6.53975 11.6797 6.42773 11.4157 6.42773 11.0957C6.42774 10.9715 6.43636 10.8445 6.45312 10.7148C6.46992 10.5851 6.49636 10.438 6.5332 10.2744L6.94531 8.7168C6.98212 8.56764 7.01389 8.42613 7.03906 8.29297C7.06411 8.15974 7.07617 8.03795 7.07617 7.92773C7.07615 7.72876 7.03797 7.58985 6.96094 7.51172C6.88379 7.43354 6.73626 7.39456 6.51855 7.39453C6.41128 7.39453 6.30078 7.41262 6.18848 7.44824C6.07638 7.4837 5.97971 7.51682 5.89941 7.54883L6.01074 7.06934C6.28219 6.95205 6.54199 6.85104 6.79004 6.76758C7.03797 6.68404 7.27296 6.64258 7.49414 6.64258ZM8.41406 3.7998C8.68563 3.7998 8.91767 3.89596 9.11035 4.08789C9.30315 4.27991 9.3994 4.51107 9.39941 4.78125C9.39941 5.0514 9.30314 5.28144 9.11035 5.47168C8.91764 5.66193 8.6857 5.75684 8.41406 5.75684C8.14253 5.75683 7.90935 5.66193 7.71484 5.47168C7.52065 5.28149 7.42383 5.05129 7.42383 4.78125C7.42384 4.51114 7.52053 4.27991 7.71484 4.08789C7.90933 3.89586 8.14251 3.79981 8.41406 3.7998Z" fill="none"/>
          </svg>
          </div>   
          <div class="reservation-left__help" data-action="help-popup" >  
            <span>${i18n.t(`WHAT IS RESERVE UNIT`)}</span>
            <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
              <path d="M8 1C4.13415 1 1.00018 4.13419 1 8C1.00018 11.8658 4.13415 15 8 15C11.8657 14.9998 14.9998 11.8658 15 8C14.9998 4.1343 11.8657 1.00018 8 1ZM8.33398 11.1963C8.77482 11.1966 9.13242 11.5543 9.13281 11.9951C9.13263 12.4361 8.77495 12.7946 8.33398 12.7949H8.3252C7.88414 12.7947 7.52655 12.4362 7.52637 11.9951C7.52676 11.5542 7.88427 11.1965 8.3252 11.1963H8.33398ZM6.6416 3.6416C7.29228 3.25931 8.05793 3.11957 8.80176 3.24707C9.54564 3.37474 10.2209 3.76149 10.707 4.33887C11.1928 4.91606 11.4598 5.64697 11.459 6.40137L11.4482 6.62598C11.346 7.72365 10.5113 8.45944 9.9043 8.86426C9.55643 9.09615 9.21313 9.2668 8.96094 9.37891C8.83407 9.43529 8.72657 9.47841 8.64941 9.50781C8.6112 9.52237 8.57939 9.5339 8.55664 9.54199C8.54548 9.54596 8.53531 9.54936 8.52832 9.55176C8.52511 9.55286 8.52179 9.55393 8.51953 9.55469L8.5166 9.55664H8.51465C8.09617 9.69607 7.64373 9.47003 7.50391 9.05176C7.36451 8.63322 7.59039 8.18073 8.00879 8.04102L8.02051 8.03613C8.0328 8.03177 8.05364 8.02472 8.08008 8.01465C8.13388 7.99414 8.21447 7.96207 8.31152 7.91895C8.5087 7.83129 8.76655 7.70151 9.01758 7.53418C9.56797 7.16708 9.86007 6.77597 9.86035 6.40137V6.40039C9.86084 6.02312 9.72729 5.65683 9.48438 5.36816C9.24142 5.07962 8.90397 4.88618 8.53223 4.82227C8.16042 4.75849 7.77745 4.82855 7.45215 5.01953C7.12691 5.21072 6.87919 5.51133 6.75391 5.86719C6.60735 6.28326 6.15056 6.5017 5.73438 6.35547C5.31847 6.20886 5.09999 5.753 5.24609 5.33691C5.4966 4.62508 5.99107 4.02406 6.6416 3.6416Z" fill="#1A1E21" fill-opacity="0.2"/>
            </svg>
          </div>      
        </div>

        <h2 class="reservation-title">${t('Reserve Unit')}</h2>
        <p class="reservation-text text-margin-btm" >${t('Secure this apartment online in just a few steps')}</p>
        
        <p class="reservation-text text-margin-btm">
          ${t(
            `This residence offers a well-balanced layout with open living areas, abundant natural light, and thoughtfully designed interiors. Floor-to-ceiling windows provide expansive views and enhance the sense of space, while high-quality finishes ensure long-term comfort and durability. Ideal for both personal living and long-term value.`,
          )}
        </p>
        <div class="price-block">
            <h3 class="reservation-subtitle">${t('Total Unit Price')}</h3>
            <strong class="reservation-strong">${formatPrice(flat.price)}</strong>
        </div>

        <button data-action="price-dynamics"  class="reservation-btn-secondary">
          <svg xmlns="http://www.w3.org/2000/svg" width="16" height="16" viewBox="0 0 16 16" fill="none">
            <path d="M0 15.2492C0 13.5597 0.227495 11.9516 0.614258 10.5754C0.99777 9.21082 1.55235 8.02386 2.24219 7.21599C2.92736 6.41362 3.88676 5.84767 4.97754 6.18279C5.98104 6.49133 6.78768 7.48918 7.43457 8.94451C7.8557 9.89204 8.36038 10.6113 8.83887 10.9885C9.07202 11.1722 9.26369 11.2471 9.40918 11.2638C9.53893 11.2788 9.68549 11.2545 9.86719 11.1301C10.281 10.8466 10.8348 10.0655 11.3418 8.33513C11.7348 6.99386 12.0738 5.16428 12.3223 2.7365C12.3187 2.74011 12.3156 2.74409 12.3125 2.74724L12.2891 2.77068C12.2866 2.77312 12.2847 2.77605 12.2822 2.77849C12.2797 2.78104 12.277 2.78376 12.2744 2.7863C12.272 2.78875 12.269 2.7907 12.2666 2.79314L12.2217 2.83806C12.2192 2.84049 12.2173 2.84345 12.2148 2.84587C12.2124 2.8483 12.2094 2.85029 12.207 2.85271C12.2046 2.85513 12.2026 2.85811 12.2002 2.86052C12.1978 2.86292 12.1948 2.86498 12.1924 2.86736C12.1505 2.90924 12.2208 2.83989 12.1787 2.88201C12.1622 2.89847 12.1805 2.87926 12.1641 2.89568C12.1192 2.94058 12.1813 2.87939 12.1367 2.924C12.1345 2.92626 12.1321 2.92858 12.1299 2.93083C12.1276 2.93312 12.1243 2.93539 12.1221 2.93767C12.1199 2.93979 12.1183 2.9424 12.1162 2.94451C12.114 2.94676 12.1116 2.9491 12.1094 2.95134C12.1037 2.95697 12.1012 2.95856 12.0957 2.96404L12.0117 3.04802C12.0096 3.05009 12.0079 3.0528 12.0059 3.05486C12.0038 3.05689 12.001 3.0587 11.999 3.06072C11.9971 3.06267 11.9951 3.06463 11.9932 3.06658C11.981 3.07874 11.9936 3.06714 11.9814 3.07927C11.9324 3.12833 11.982 3.07773 11.9336 3.12615C11.9317 3.128 11.9296 3.13016 11.9277 3.13201C11.9259 3.1338 11.9246 3.13608 11.9229 3.13787C11.9211 3.13965 11.9188 3.14098 11.917 3.14275L11.8564 3.20329C11.8547 3.20505 11.8533 3.20741 11.8516 3.20915C11.8498 3.21091 11.8474 3.21229 11.8457 3.21404L11.6943 3.3654C11.6927 3.36704 11.6793 3.38138 11.6777 3.38298C11.6745 3.38624 11.6722 3.38758 11.6689 3.39079L11.4766 3.58318C11.461 3.59871 11.4822 3.5785 11.4668 3.59392C11.4566 3.6041 11.4661 3.59362 11.4561 3.60369L11.4248 3.63494C11.4176 3.64209 11.428 3.63272 11.4209 3.63982C11.3907 3.67 11.4341 3.62569 11.4043 3.65544L11.333 3.72673C11.3318 3.72794 11.3322 3.72853 11.3311 3.72966L11.3291 3.73064L11.3203 3.73943C11.3189 3.74089 11.3189 3.74184 11.3174 3.74333C11.3112 3.74951 11.3162 3.7435 11.3105 3.74919L11.3047 3.75505C11.2905 3.7692 11.2997 3.76102 11.2891 3.77165C11.2859 3.77484 11.282 3.7777 11.2812 3.77849L11.2803 3.77947C10.9874 4.07236 10.5116 4.07334 10.2188 3.78044C9.92599 3.48763 9.92612 3.01279 10.2188 2.7199L10.3076 2.63103L10.3086 2.62908C10.3142 2.62352 10.3098 2.62887 10.3154 2.62322L12.7188 0.219896C12.8696 0.06905 13.078 -0.010651 13.291 0.00114632C13.5039 0.0130416 13.7018 0.114971 13.835 0.28142L15.835 2.78142C16.0935 3.10474 16.0408 3.57634 15.7178 3.83513C15.3944 4.09386 14.9219 4.04225 14.6631 3.71892L13.835 2.68376C13.5791 5.27161 13.2189 7.26322 12.7812 8.75701C12.2537 10.5574 11.5787 11.7768 10.7148 12.3683C10.2578 12.6813 9.7533 12.8132 9.23828 12.7541C8.7389 12.6966 8.29138 12.4666 7.91016 12.1662C7.15964 11.5746 6.53211 10.6061 6.06445 9.55388C5.46154 8.19737 4.89279 7.72678 4.53711 7.61736C4.26883 7.53487 3.8849 7.60172 3.38281 8.18962C2.88535 8.77217 2.40841 9.73333 2.05762 10.9816C1.71008 12.2184 1.5 13.689 1.5 15.2492C1.49988 15.6633 1.16414 15.9992 0.75 15.9992C0.335861 15.9992 0.000120579 15.6633 0 15.2492Z" fill="#1A1E21" fill-opacity="0.2"/>
          </svg>    
        ${t('Show price change dynamics')}
        </button>

        <button data-action="estimated-income" class="reservation-btn-secondary">
            <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
              <path d="M7 0C3.13415 0 0.00017643 3.13419 0 7C0.000181198 10.8658 3.13415 14 7 14C10.8657 13.9998 13.9998 10.8658 14 7C13.9998 3.1343 10.8657 0.000176578 7 0ZM7.33398 10.1963C7.77482 10.1966 8.13242 10.5543 8.13281 10.9951C8.13263 11.4361 7.77495 11.7946 7.33398 11.7949H7.3252C6.88414 11.7947 6.52655 11.4362 6.52637 10.9951C6.52676 10.5542 6.88427 10.1965 7.3252 10.1963H7.33398ZM5.6416 2.6416C6.29228 2.25931 7.05793 2.11957 7.80176 2.24707C8.54564 2.37474 9.22092 2.76149 9.70703 3.33887C10.1928 3.91606 10.4598 4.64697 10.459 5.40137L10.4482 5.62598C10.346 6.72365 9.51131 7.45944 8.9043 7.86426C8.55643 8.09615 8.21313 8.2668 7.96094 8.37891C7.83407 8.43529 7.72657 8.47841 7.64941 8.50781C7.6112 8.52237 7.57939 8.5339 7.55664 8.54199C7.54548 8.54596 7.53531 8.54936 7.52832 8.55176C7.52511 8.55286 7.52179 8.55393 7.51953 8.55469L7.5166 8.55664H7.51465C7.09617 8.69607 6.64373 8.47003 6.50391 8.05176C6.36451 7.63322 6.59039 7.18073 7.00879 7.04102L7.02051 7.03613C7.0328 7.03177 7.05364 7.02472 7.08008 7.01465C7.13388 6.99414 7.21447 6.96207 7.31152 6.91895C7.5087 6.83129 7.76655 6.70151 8.01758 6.53418C8.56797 6.16708 8.86007 5.77597 8.86035 5.40137V5.40039C8.86084 5.02312 8.72729 4.65683 8.48438 4.36816C8.24142 4.07962 7.90397 3.88618 7.53223 3.82227C7.16042 3.75849 6.77745 3.82855 6.45215 4.01953C6.12691 4.21072 5.87919 4.51133 5.75391 4.86719C5.60735 5.28326 5.15056 5.5017 4.73438 5.35547C4.31847 5.20886 4.09999 4.753 4.24609 4.33691C4.4966 3.62508 4.99107 3.02406 5.6416 2.6416Z" fill="#1A1E21" fill-opacity="0.2"/>
            </svg>
            ${t('Estimated annual income≈')}
            <strong>${estimatedIncome}</strong>
        </button>

      </div>


      <div class="reservation-right">
          <div class="reservation-agree-wrap">
            <span class="reservation-subtitle" >${t('Reservation Agreement')}</span>
            <strong class="reservation-strong">${reservationAmount}</strong>
          </div>
          <div class = "reservation-period-wrap"> 
            <div class="space-between">
                <span class="reservation-text">${t('Reservation Period')}</span>
                <span class="reservation-text"><strong class="reservation-strong">7</strong> Days</span> 
            </div>
            <div class="space-between">
                <span class="reservation-text">${t('Purchase timeline')}</span>
                <span class="reservation-text"><strong class="reservation-strong">137 </strong>Days</span>
            </div>
          </div>
          <div class="reservation-check-wrap">
            <div class="reservation-check-svg" >
              <svg xmlns="http://www.w3.org/2000/svg" width="19" height="14" viewBox="0 0 19 14" fill="none">
                <path d="M18.5602 0.43934C17.9745 -0.146447 17.0249 -0.146447 16.4392 0.43934L6.4997 10.3788L2.56025 6.43934C1.97446 5.85355 1.02494 5.85355 0.439152 6.43934C-0.14631 7.02515 -0.146526 7.97475 0.439152 8.56043L5.43915 13.5604C6.02484 14.146 6.97448 14.1458 7.56025 13.5604L18.5602 2.56043C19.146 1.9747 19.1459 1.02514 18.5602 0.43934Z" fill="#83AF8D"/>
              </svg>
            </div>
            <p class="reservation-text">
              ${t('The unit will be held for 7 days following the reservation.')}
            </p>
          </div>

          <button data-action="reserve-unit" class="btn-primary">
              ${t('Reserve Unit')}
          </button>

          <p class="reservation-secure">
            ${t('Secure payment')}
          </p>
          <p class="reservation-text reservation-refund"> 
            ${t('Fully refundable if terms are not confirmed')}
          </p>
      </div>
    </section>
  `;
}
